Configure Plan

Terraform will perform the following actions:

  # module.channel.twilio_conversations_configuration_addresses_v1.conversations_address["facebook"] will be created
  + resource "twilio_conversations_configuration_addresses_v1" "conversations_address" {
      + address                                = "messenger:565233119996327"
      + auto_creation_conversation_service_sid = "IScc78c44c289c4bbc8cd4b64576ed5121"
      + auto_creation_enabled                  = true
      + auto_creation_studio_flow_sid          = (known after apply)
      + auto_creation_studio_retry_count       = (known after apply)
      + auto_creation_type                     = "studio"
      + auto_creation_webhook_filters          = (known after apply)
      + auto_creation_webhook_method           = (known after apply)
      + auto_creation_webhook_url              = (known after apply)
      + friendly_name                          = "Facebook Conversation Address"
      + id                                     = (known after apply)
      + sid                                    = (known after apply)
      + type                                   = "messenger"
    }

  # module.channel.twilio_studio_flows_v2.channel_studio_flow["facebook"] will be created
  + resource "twilio_studio_flows_v2" "channel_studio_flow" {
      + commit_message = (known after apply)
      + definition     = jsonencode(
            {
              + description   = "Facebook Studio Flow"
              + flags         = {
                  + allow_concurrent_calls = true
                }
              + initial_state = "Trigger"
              + states        = [
                  + {
                      + name        = "Trigger"
                      + properties  = {
                          + offset = {
                              + x = -160
                              + y = -460
                            }
                        }
                      + transitions = [
                          + {
                              + event = "incomingMessage"
                            },
                          + {
                              + event = "incomingCall"
                            },
                          + {
                              + event = "incomingConversationMessage"
                              + next  = "getProfileFlagsForIdentifier"
                            },
                          + {
                              + event = "incomingRequest"
                            },
                          + {
                              + event = "incomingParent"
                            },
                        ]
                      + type        = "trigger"
                    },
                  + {
                      + name        = "getProfileFlagsForIdentifier"
                      + properties  = {
                          + body         = "{ \"trigger\": {{trigger | to_json}}, \"channelType\": \"facebook\"}"
                          + content_type = "application/json;charset=utf-8"
                          + method       = "POST"
                          + offset       = {
                              + x = -350
                              + y = -280
                            }
                          + url          = "https://serverless-4475-production.twil.io/getProfileFlagsForIdentifier"
                        }
                      + transitions = [
                          + {
                              + event = "success"
                              + next  = "contact_routing"
                            },
                          + {
                              + event = "failed"
                              + next  = "attributes"
                            },
                        ]
                      + type        = "make-http-request"
                    },
                  + {
                      + name        = "send_blocked_message"
                      + properties  = {
                          + body    = "Hi, you've been blocked from accessing our services and we are not able to read or receive further messages from you."
                          + channel = "{{trigger.conversation.ChannelSid}}"
                          + from    = "C-Sema"
                          + offset  = {
                              + x = -640
                              + y = 210
                            }
                          + service = "{{trigger.conversation.InstanceSid}}"
                          + to      = "{{contact.channel.address}}"
                        }
                      + transitions = [
                          + {
                              + event = "sent"
                            },
                          + {
                              + event = "failed"
                            },
                        ]
                      + type        = "send-message"
                    },
                  + {
                      + name        = "contact_routing"
                      + properties  = {
                          + input  = "{{widgets.getProfileFlagsForIdentifier.parsed.flags}}"
                          + offset = {
                              + x = -690
                              + y = -60
                            }
                        }
                      + transitions = [
                          + {
                              + event = "noMatch"
                              + next  = "attributes"
                            },
                          + {
                              + conditions = [
                                  + {
                                      + arguments     = [
                                          + "{{widgets.getProfileFlagsForIdentifier.parsed.flags}}",
                                        ]
                                      + friendly_name = "If value contains blocked"
                                      + type          = "contains"
                                      + value         = "blocked"
                                    },
                                ]
                              + event      = "match"
                              + next       = "send_blocked_message"
                            },
                        ]
                      + type        = "split-based-on"
                    },
                  + {
                      + name        = "attributes"
                      + properties  = {
                          + attributes = <<-EOT
                                {
                                  "name": "{{trigger.conversation.ChannelAttributes.from}}",
                                  "channelType": "{% if trigger.conversation.ChannelAttributes.channel_type %}{{trigger.conversation.ChannelAttributes.channel_type}}{% else %}{{trigger.conversation.Source | downcase}}{% endif %}",
                                  "customChannelType": "{{trigger.conversation.ChannelAttributes.channelType}}", 
                                  "channelSid": "{{trigger.conversation.ChannelSid}}",
                                  "twilioNumber": "{{trigger.conversation.ChannelAttributes.twilioNumber}}",
                                  "ignoreAgent": "",
                                  "helpline":"C-Sema",
                                  "language":"en-US",
                                  "transferTargetType": "",
                                  "memory": {{trigger.conversation.ChannelAttributes.memory | to_json}}
                                }
                            EOT
                          + channel    = "TCbe486a1586caadcee373f83c78cf1fed"
                          + offset     = {
                              + x = 80
                              + y = 250
                            }
                          + workflow   = "WW6f38c8d7766584a02077e95f401ddb9c"
                        }
                      + transitions = [
                          + {
                              + event = "callComplete"
                            },
                          + {
                              + event = "failedToEnqueue"
                              + next  = "webhook_notify_failed_to_enqueue"
                            },
                          + {
                              + event = "callFailure"
                            },
                        ]
                      + type        = "send-to-flex"
                    },
                  + {
                      + name        = "webhook_notify_failed_to_enqueue"
                      + properties  = {
                          + add_twilio_auth = false
                          + body            = jsonencode(
                                {
                                  + text = "Issue detected [Failed to Enqueue] on TZ STG Flow SID: {{flow.flow_sid}} Execution SID: {{flow.sid}}  "
                                }
                            )
                          + content_type    = "application/json;charset=utf-8"
                          + method          = "POST"
                          + offset          = {
                              + x = 540
                              + y = 1250
                            }
                          + url             = "https://hooks.slack.com/services/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"
                        }
                      + transitions = [
                          + {
                              + event = "success"
                            },
                          + {
                              + event = "failed"
                            },
                        ]
                      + type        = "make-http-request"
                    },
                ]
            }
        )
      + friendly_name  = "Facebook Studio Flow"
      + id             = (known after apply)
      + sid            = (known after apply)
      + status         = "published"
    }

  # module.channel.twilio_studio_flows_v2.channel_studio_flow["webchat"] will be updated in-place
  ~ resource "twilio_studio_flows_v2" "channel_studio_flow" {
      ~ definition    = jsonencode( # whitespace changes
            {
                description   = "Webchat Studio Flow"
                flags         = {
                    allow_concurrent_calls = true
                }
                initial_state = "Trigger"
                states        = [
                    {
                        name        = "Trigger"
                        properties  = {
                            offset = {
                                x = 0
                                y = 0
                            }
                        }
                        transitions = [
                            {
                                event = "incomingMessage"
                                next  = "attributes"
                            },
                            {
                                event = "incomingCall"
                            },
                            {
                                event = "incomingConversationMessage"
                            },
                            {
                                event = "incomingRequest"
                            },
                            {
                                event = "incomingParent"
                            },
                        ]
                        type        = "trigger"
                    },
                    {
                        name        = "attributes"
                        properties  = {
                            attributes = <<-EOT
                                {
                                  "e2eTestMode": "{{trigger.message.ChannelAttributes.pre_engagement_data.e2eTestMode}}",
                                  "ip": "{{trigger.message.ChannelAttributes.pre_engagement_data.ip}}",
                                  "firstName": "{{trigger.message.ChannelAttributes.from}}",
                                  "channelType": "{{trigger.message.ChannelAttributes.channel_type}}",
                                  "channelSid": "{{trigger.message.ChannelSid}}",
                                  "helpline": "{{trigger.message.ChannelAttributes.pre_engagement_data.helpline}}",
                                  "language":"en-US",
                                  "ignoreAgent": "",
                                  "transferTargetType": "",
                                  "preEngagementData": {{trigger.message.ChannelAttributes.pre_engagement_data | to_json}},
                                  "memory": {{trigger.message.ChannelAttributes.memory | to_json}}
                                }
                            EOT
                            channel    = "TCbe486a1586caadcee373f83c78cf1fed"
                            offset     = {
                                x = 80
                                y = 250
                            }
                            workflow   = "WW6f38c8d7766584a02077e95f401ddb9c"
                        }
                        transitions = [
                            {
                                event = "callComplete"
                            },
                            {
                                event = "failedToEnqueue"
                                next  = "webhook_notify_failed_to_enqueue"
                            },
                            {
                                event = "callFailure"
                            },
                        ]
                        type        = "send-to-flex"
                    },
                    {
                        name        = "webhook_notify_failed_to_enqueue"
                        properties  = {
                            add_twilio_auth = false
                            body            = jsonencode(
                                {
                                    text = "Issue detected [Failed to Enqueue] on TZ STG Flow SID: {{flow.flow_sid}} Execution SID: {{flow.sid}}  "
                                }
                            )
                            content_type    = "application/json;charset=utf-8"
                            method          = "POST"
                            offset          = {
                                x = 540
                                y = 1250
                            }
                            url             = "https://hooks.slack.com/services/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"
                        }
                        transitions = [
                            {
                                event = "success"
                            },
                            {
                                event = "failed"
                            },
                        ]
                        type        = "make-http-request"
                    },
                ]
            }
        )
        id            = "FW17636204ad4a23066d98c69cfc9e71aa"
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.